# TabbedDialogExtension Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TabbedDialogExtension Properties
TabbedDialogExtension Class See Also
---
The TabbedDialogExtension type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Control | The control. |
| OnCancelAction | The cancel handler. |
| OnOKAction | The ok handler. |
| OnRestoreDefaultsAction | The restore defaults handler. |

# See Also
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace